[
    {
        "title": "Telangana tops country in cyber attacks: Data Security Council of India",
        "date": "Dec 06, 2024, 11:51 (IST)",
        "description": "Telangana leads India in cyberattacks, followed by Tamil Nadu and Delhi, according to a new report. The financial and healthcare sectors are the most targeted. Attackers are expanding their reach to Tier 2 cities, likely due to weaker cyber defenses in these areas."
    },
    {
        "title": "Govt asks Meta to tackle cyber frauds on WhatsApp",
        "date": "Dec 06, 2024, 22:44 (IST)",
        "description": "The Indian government has raised concerns with Meta regarding the increasing use of WhatsApp for online fraud. The IT Ministry has urged Meta to implement stronger measures to combat these scams, which have cost victims thousands of crores of rupees. Meta claims to be using AI and other technologies to address the issue and is cooperating with law enforcement."
    },
    {
        "title": "PTR: Cyber frauds led to 1,100 crore losses in state",
        "date": "Dec 05, 2024, 23:53 (IST)",
        "description": ""
    },
    {
        "title": "73% establishments failed to report cyber attacks: Survey",
        "date": "Dec 07, 2024, 23:41 (IST)",
        "description": ""
    },
    {
        "title": "Under ‘digital arrest’ for 17 days, Hyderabad family loses Rs 5.5 crore",
        "date": "Dec 11, 2024, 00:12 (IST)",
        "description": "A Hyderabad woman and her daughters were scammed out of ₹5.5 crore by fraudsters posing as national agency investigators. The family was kept under digital surveillance for 17 days, allowed out only for exams. Fake CBI and RBI documents were used to coerce them into transferring funds."
    },
    {
        "title": "TCS launches 2025 Cybersecurity Outlook: Names these 7 key tech priorities for enterprises",
        "date": "Dec 10, 2024, 18:41 (IST)",
        "description": "Tata Consultancy Services (TCS) emphasizes the need for businesses to bolster cybersecurity by leveraging AI, prioritizing cloud security, and building resilient supply chains. The report urges companies to adopt a 'security by design' approach for emerging technologies and implement Zero Trust architecture to combat evolving cyber threats and ensure business continuity."
    },
    {
        "title": "Government warns: This is one of the 'Digital Arrest' letters that criminals have used to dupe crores from people across India",
        "date": "Nov 28, 2024, 13:02 (IST)",
        "description": "The Indian government has issued a warning concerning a pervasive cyber scam involving fake \"digital arrest\" threats. Scammers impersonate government agencies, demanding compliance under fabricated charges. The PIB Fact Check unit has confirmed the letters' fraudulent nature, urging citizens to verify information through official channels and report suspicious activity."
    },
    {
        "title": "Beware of digital wedding invites! Conmen using them to hack phones",
        "date": "Dec 10, 2024, 00:46 (IST)",
        "description": ""
    },
    {
        "title": "From 105 in 2022, victims of online trading scam jump to 40k in 2 yrs",
        "date": "Dec 09, 2024, 18:38 (IST)",
        "description": ""
    },
    {
        "title": "Need 'civilian army' to protect nation's interests: SC judge Surya Kant",
        "date": "Dec 08, 2024, 16:03 (IST)",
        "description": "Supreme Court Justice Surya Kant emphasized the importance of a \"civilian army\" of experts across various fields to safeguard national interests. Speaking at an international moot court competition, he highlighted the value of such events in developing essential skills like research, oration, and critical thinking for students pursuing law and other public service roles."
    }
]